

public interface IKeyboardSpec : IKeyboard
{
    /**
     * 
     * 
    Backspase — удаляет знаки, находящиеся слева от мигающего курсора во время печатания текста. И возвращает на предыдущую страницу в браузерах и в окнах «Проводника», заменяя стрелочку «назад», в верхнем левом углу.

Tab — табуляция фиксирует курсор в определённом месте строки. Необходим для работы в программах Word, Excel, Access. А в обычном печатании – быстро переходит на конец пустой строки.

     Caps Lock — фиксатор заглавных и прописных букв. Если надо весь текст напечатать заглавными буквами – нажмите клавишу Caps Lock. Вернуть в обычное положение – нажмите ещё раз.

     Shift — кратковременное нажатие этой клавиши – даёт заглавную букву. Для того, чтобы напечатать заглавную, надо сначала нажать клавишу Shift и удерживая её нажать нужную букву. Клавишу Shift можно нажимать и справа, и слева, как вам удобнее.

        Alt — чтобы перейти на противоположный язык (с английского на русский и наоборот) – надо нажать клавишу Alt и не отпуская её клавишу Shift. Нажатие и удержание клавиши AltGr (правый Alt) используется для перехода на второй уровень клавиатуры.

     Ctrl — справа и слева. Открывает дополнительные возможности программ.

     Nut Look — при включённом индикаторе Nut Look – работает цифровая (числовая) клавиатура, которая расположена на клавиатуре либо отдельным блоком, справа, либо в центре, на клавишах –алфавитно-цифровых.

        Enter — клавиша ввода информации, подтверждает команду «да». Например: вы вводите в адресную строку браузера какой-либо адрес, но никакой кнопки «найти» там нет, поэтому нажимаем клавишу Enter, тем самым давая команду браузеру – найти. В поисковых  строках также можно не нажимать «найти», а нажать Enter. И при переходе на следующую строку при печатании – также, нажимаем Ente
     * 
     */

}
